src/cfe/DataProcessors/OData4_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>OData4_Настройки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cfe/Catalogs/OData4_Профили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>OData4_Профили</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаибольшийTop</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаExpand</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаговApply</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложностьФильтра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацийBatch</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрешено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключённыеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыШаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитыЧастоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запросов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секунд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/DataProcessors/OData4_Настройки/Forms/Профиль/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Форма «Профиль OData4» (задача 11 плана 5.3): редактирует элемент справочника OData4_Профили. Параметр
// формы Профиль — ссылка на элемент; пустая ссылка или отсутствие параметра — новый профиль.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ссылка = Неопределено;
	Если Параметры.Свойство("Профиль", Ссылка) И ЗначениеЗаполнено(Ссылка) Тогда
		ПрофильСсылка = Ссылка;
		ЗначениеВРеквизитФормы(ПрофильСсылка.ПолучитьОбъект(), "Объект");
	Иначе
		ЗначениеВРеквизитФормы(Справочники.OData4_Профили.СоздатьЭлемент(), "Объект");
	КонецЕсли;
	ЗаполнитьДеревоПрав();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Только клиентские данные: при завершении работы серверные вызовы запрещены (блокер ручной проверки).
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	Если ЗавершениеРаботы Тогда
		ТекстПредупреждения = "Профиль OData4 не записан.";
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Профиль изменён. Записать?", РежимДиалогаВопрос.ДаНетОтмена);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПравоПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

// Любое поле или строка табличной части карточки изменены.
&НаКлиенте
Процедура ПолеПрофиляПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПрофиляПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = Истина;
КонецПроцедуры

// Добавление и удаление строк — тоже изменение: по клавише Delete правка иначе терялась молча
// (наблюдение приёмки к дефекту Р1).
&НаКлиенте
Процедура ТаблицаПрофиляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПрофиляПередУдалением(Элемент, Отказ)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	Если ЗаписатьНаКлиенте() Тогда
		Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗаписатьНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если Не ЗаписатьНаКлиенте() Тогда
			Возврат;
		КонецЕсли;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Ложь;
	Закрыть(Истина);
КонецПроцедуры

// Записывает профиль; Истина — записан. Отказ — сообщение с фактическими ошибками проверки профиля.
&НаКлиенте
Функция ЗаписатьНаКлиенте() Экспорт
	Ошибки = ЗаписатьНаСервере();
	Если ПустаяСтрока(Ошибки) Тогда
		Модифицированность = Ложь;
		// Список профилей владельца обновляется сразу (замечание пользователя 5).
		ОповеститьОбИзменении(Тип("СправочникСсылка.OData4_Профили"));
		Оповестить("OData4_ПрофильЗаписан", ПрофильСсылка, ЭтотОбъект);
		Возврат Истина;
	КонецЕсли;
	ПоказатьПредупреждение(, Ошибки);
	Возврат Ложь;
КонецФункции

// Дерево прав в табличную часть Права, проверка профиля (OData4_Профили.ПроверитьПрофиль) и запись.
// Возвращает текст ошибок (пустой — записано); при ошибках профиль не пишется.
// Экспорт — для клиентского теста формы (возвращает текст отказа).
&НаСервере
Функция ЗаписатьНаСервере() Экспорт
	ПрофильОбъект = РеквизитФормыВЗначение("Объект");
	ЗаполнитьПраваИзДерева(ПрофильОбъект);
	Ошибки = OData4_Профили.ПроверитьПрофиль(ПрофильОбъект);
	Если Ошибки.Количество() > 0 Тогда
		Возврат "Профиль не записан:" + Символы.ПС + СтрСоединить(ПонятныеОшибки(Ошибки), Символы.ПС);
	КонецЕсли;
	Попытка
		ПрофильОбъект.Записать();
	Исключение
		Возврат "Профиль не записан: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	ПрофильСсылка = ПрофильОбъект.Ссылка;
	ЗначениеВРеквизитФормы(ПрофильОбъект, "Объект");
	ЗаполнитьДеревоПрав();
	Возврат "";
КонецФункции

// Тексты ошибок проверки профиля без внутренних имён табличных частей (замечание пользователя 13).
&НаСервереБезКонтекста
Функция ПонятныеОшибки(Ошибки)
	Замены = Новый Соответствие;
	Замены.Вставить("ОтборыОбъектов строка", "Отборы, строка");
	Замены.Вставить("ОтборыШаблоны строка", "Шаблонные отборы, строка");
	Замены.Вставить("ИсключённыеПоля строка", "Исключённые поля, строка");
	Замены.Вставить("ЛимитыЧастоты строка", "Правила частоты, строка");
	Замены.Вставить("Права строка", "Права, строка");
	Результат = Новый Массив;
	Для Каждого Текст Из Ошибки Цикл
		Понятный = Текст;
		Для Каждого КлючИЗначение Из Замены Цикл
			Понятный = СтрЗаменить(Понятный, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		Результат.Добавить(Понятный);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Дерево прав: строка «Все объекты» («*»), ветки видов и объекты действующего состава публикации; флажки
// операций — из табличной части Права (правило объекта, вида или «*»).
&НаСервере
Процедура ЗаполнитьДеревоПрав()
	ПрофильОбъект = РеквизитФормыВЗначение("Объект");
	Правила = Новый Соответствие;
	Для Каждого Строка0 Из ПрофильОбъект.Права Цикл
		Объект0 = СокрЛП(Строка0.Объект);
		Операции = Правила.Получить(Объект0);
		Если Операции = Неопределено Тогда
			Операции = Новый Соответствие;
			Правила.Вставить(Объект0, Операции);
		КонецЕсли;
		Прежнее = Операции.Получить(СокрЛП(Строка0.Операция));
		Операции.Вставить(СокрЛП(Строка0.Операция), Строка0.Разрешено И Прежнее <> Ложь);
	КонецЦикла;
	ПоказанныеВДереве = Новый Соответствие;
	Дерево = РеквизитФормыВЗначение("ДеревоПрав");
	Дерево.Строки.Очистить();
	Все = Дерево.Строки.Добавить();
	Все.Имя = "*";
	Все.Объект = "*";
	Все.Представление = "Все объекты (*)";
	Все.Вид = "Все";
	ЗаполнитьФлажки(Все, Правила.Получить("*"));
	ПоказанныеВДереве.Вставить("*", Истина);
	Ветки = Новый Соответствие;
	Имена = Новый Массив;
	Для Каждого КлючИЗначение Из OData4_Состав.ДействующийСостав() Цикл
		Имена.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	// Ветки идут в том же порядке, что виды на вкладке «Состав» (замечание пользователя 12).
	Для Каждого Вид Из ПорядокВидов() Цикл
		Ветка = Все.Строки.Добавить();
		Ветка.Имя = Вид;
		Ветка.Объект = Вид;
		Ветка.Представление = ПредставлениеВида(Вид);
		Ветка.Вид = "Ветка";
		ЗаполнитьФлажки(Ветка, Правила.Получить(Вид));
		Ветки.Вставить(Вид, Ветка);
	КонецЦикла;
	Для Каждого ПолноеИмя Из OData4_Модель.УпорядочитьСтроки(Имена) Цикл
		Вид = СтрРазделить(ПолноеИмя, ".")[0];
		Ветка = Ветки.Получить(Вид);
		Если Ветка = Неопределено Тогда
			Ветка = Все.Строки.Добавить();
			Ветка.Имя = Вид;
			Ветка.Объект = Вид;
			Ветка.Представление = ПредставлениеВида(Вид);
			Ветка.Вид = "Ветка";
			ЗаполнитьФлажки(Ветка, Правила.Получить(Вид));
			Ветки.Вставить(Вид, Ветка);
		КонецЕсли;
		Строка0 = Ветка.Строки.Добавить();
		Строка0.Имя = Сред(ПолноеИмя, СтрДлина(Вид) + 2);
		Строка0.Объект = ПолноеИмя;
		Строка0.Представление = Строка0.Имя;
		Строка0.Вид = "Объект";
		ЗаполнитьФлажки(Строка0, Правила.Получить(ПолноеИмя));
		ПоказанныеВДереве.Вставить(ПолноеИмя, Истина);
	КонецЦикла;
	// Ветки без объектов состава не показываются.
	Индекс = Все.Строки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если Все.Строки[Индекс].Строки.Количество() = 0 Тогда
			Все.Строки.Удалить(Индекс);
		Иначе
			ПоказанныеВДереве.Вставить(Все.Строки[Индекс].Объект, Истина);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	ЗаполнитьПрочиеПравила(ПрофильОбъект, ПоказанныеВДереве);
	ЗначениеВРеквизитФормы(Дерево, "ДеревоПрав");
КонецПроцедуры

// Флажки операций строки дерева по правилам объекта (Соответствие «операция → Булево»).
&НаСервереБезКонтекста
Процедура ЗаполнитьФлажки(Строка0, Операции)
	Если Операции = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Операция0 Из ОперацииПрофиля() Цикл
		Если Операции.Получить(Операция0) = Истина Тогда
			Строка0[Операция0] = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Правила, которых дерево не показывает (дефект приёмки 5.3 Д4): запреты (Разрешено = Ложь) и правила
// объектов или видов вне действующего состава публикации. Форма их не меняет, но сохраняет при записи.
&НаСервере
Процедура ЗаполнитьПрочиеПравила(ПрофильОбъект, ПоказанныеВДереве)
	ПрочиеПравила.Очистить();
	Для Каждого Строка0 Из ПрофильОбъект.Права Цикл
		Объект0 = СокрЛП(Строка0.Объект);
		Показан = ПоказанныеВДереве.Получить(Объект0) = Истина;
		Если Показан И Строка0.Разрешено Тогда
			Продолжить;
		КонецЕсли;
		Новая = ПрочиеПравила.Добавить();
		Новая.Объект = Строка0.Объект;
		Новая.Представление = ?(СтрНайти(Объект0, ".") = 0 И Объект0 <> "*", ПредставлениеВида(Объект0),
			Строка0.Объект);
		Новая.Операция = Строка0.Операция;
		Новая.Разрешено = Строка0.Разрешено;
		Новая.Причина = ?(Не Строка0.Разрешено, "запрет", "объекта или вида нет в составе публикации");
	КонецЦикла;
КонецПроцедуры

// Табличная часть Права по дереву: строка пишется только для отмеченной операции (снятый флажок — правила нет).
&НаСервере
Процедура ЗаполнитьПраваИзДерева(ПрофильОбъект)
	ПрофильОбъект.Права.Очистить();
	// Правила, которых дерево не показывает, сохраняются как были (Д4).
	Для Каждого Строка0 Из ПрочиеПравила Цикл
		Правило = ПрофильОбъект.Права.Добавить();
		Правило.Объект = Строка0.Объект;
		Правило.Операция = Строка0.Операция;
		Правило.Разрешено = Строка0.Разрешено;
	КонецЦикла;
	Для Каждого Все Из ДеревоПрав.ПолучитьЭлементы() Цикл
		ДобавитьПрава(ПрофильОбъект, Все);
		Для Каждого Ветка Из Все.ПолучитьЭлементы() Цикл
			ДобавитьПрава(ПрофильОбъект, Ветка);
			Для Каждого Объект0 Из Ветка.ПолучитьЭлементы() Цикл
				ДобавитьПрава(ПрофильОбъект, Объект0);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьПрава(ПрофильОбъект, Строка0)
	Для Каждого Операция0 Из ОперацииПрофиля() Цикл
		Если Строка0[Операция0] Тогда
			Правило = ПрофильОбъект.Права.Добавить();
			Правило.Объект = Строка0.Объект;
			Правило.Операция = Операция0;
			Правило.Разрешено = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Порядок видов объектов — как на вкладке «Состав».
&НаСервереБезКонтекста
Функция ПорядокВидов()
	Возврат СтрРазделить("Справочник,Документ,ЖурналДокументов,Константа,ПланВидовХарактеристик,ПланСчетов,"
		+ "ПланВидовРасчета,ПланОбмена,БизнесПроцесс,Задача,РегистрСведений,РегистрНакопления,"
		+ "РегистрБухгалтерии,РегистрРасчета", ",");
КонецФункции

// Представление вида объектов — как на вкладке «Состав» (замечание пользователя 12).
&НаСервереБезКонтекста
Функция ПредставлениеВида(Вид)
	Виды = Новый Соответствие;
	Пары = "Справочник:Справочники,Документ:Документы,ЖурналДокументов:Журналы документов,"
		+ "Константа:Константы,ПланВидовХарактеристик:Планы видов характеристик,ПланСчетов:Планы счетов,"
		+ "ПланВидовРасчета:Планы видов расчёта,ПланОбмена:Планы обмена,БизнесПроцесс:Бизнес-процессы,"
		+ "Задача:Задачи,РегистрСведений:Регистры сведений,РегистрНакопления:Регистры накопления,"
		+ "РегистрБухгалтерии:Регистры бухгалтерии,РегистрРасчета:Регистры расчёта";
	Для Каждого Пара Из СтрРазделить(Пары, ",") Цикл
		Части = СтрРазделить(Пара, ":");
		Виды.Вставить(Части[0], Части[1]);
	КонецЦикла;
	Представление = Виды.Получить(Вид);
	Возврат ?(Представление = Неопределено, Вид, Представление);
КонецФункции

// Операции матрицы прав профиля (значения ресурса Операция).
&НаСервереБезКонтекста
Функция ОперацииПрофиля()
	Возврат СтрРазделить("Чтение,Добавление,Изменение,Удаление,Проведение,ОтменаПроведения,ФизическоеУдаление", ",");
КонецФункции

#КонецОбласти
